Revit 2026 API

# Asset Class

---

Represents a connected property of material.

SystemObject Autodesk.Revit.DB.VisualAssetProperty Autodesk.Revit.DB.VisualAssetProperties Autodesk.Revit.DB.VisualAsset

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Asset : AssetProperties
```
```vb
Public Class Asset
	Inherits AssetProperties
```
```cpp
public ref class Asset : public AssetProperties
```
```fsharp
type Asset =
    class
        inherit AssetProperties
    end
```

The Asset type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AssetType | The type of RenderingAsset |
|  | IsReadOnly | Identifies if the object is read-only or modifiable. If true, the object may not be modified. If false, the object's contents may be modified. (Inherited from AssetProperty) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from AssetProperty) |
|  | Item | (Inherited from AssetProperties) |
|  | LibraryName | Library name |
|  | Name | Get the name of the AssetProperty(Inherited from AssetProperty) |
|  | NumberOfConnectedProperties | The number of currently connected properties. (Inherited from AssetProperty) |
|  | Size | The number of the AssetProperty(s) in the object. (Inherited from AssetProperties) |
|  | Title | Asset title |
|  | Type | Returns the type of the AssetProperty(Inherited from AssetProperty) |

|  | Name | Description |
| --- | --- | --- |
|  | AddConnectedAsset | Adds a new connected asset attached to this asset property, if it allows it. (Inherited from AssetProperty) |
|  | AddCopyAsConnectedAsset | Makes a copy of the asset and connects it to this property. (Inherited from AssetProperty) |
|  | Dispose | (Inherited from AssetProperty) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | FindByName | Gets the property with the given name. (Inherited from AssetProperties) |
|  | Get | Gets the property at the given index. (Inherited from AssetProperties) |
|  | GetAllConnectedProperties | Gets the list of the connected properties. Connected properties are the detachable properties of an AssetProperty. e.g. diffuse property can have texture as its connected property. It can also detach texture on runtime. (Inherited from AssetProperty) |
|  | GetConnectedProperty | Gets one connected property with specified index. (Inherited from AssetProperty) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetSingleConnectedAsset | Gets the single connected asset attached to this asset property, if it exists. (Inherited from AssetProperty) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsEditable | Check if property can be edited. (Inherited from AssetProperty) |
|  | IsValidIndex | Returns true if the provided index is valid. (Inherited from AssetProperties) |
|  | IsValidSchemaIdentifier | Check that schema name is valid (Inherited from AssetProperty) |
|  | RemoveConnectedAsset | Removes the connected asset attached to this asset property if any. (Inherited from AssetProperty) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Visual Namespace